{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/celiazhu/Box/projects/ra_code_sample/stata/ra_stata_sample.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 9 Sep 2020, 12:45:49
{txt}
{com}. //_1
. clear all
{res}{txt}
{com}. set more off
{txt}
{com}. set varabbrev off
{txt}
{com}. 
. * Set up directories
. global data /Users/celiazhu/Box/projects/ra_code_sample/data
{txt}
{com}. global output /Users/celiazhu/Box/projects/ra_code_sample/stata/output
{txt}
{com}. global processed /Users/celiazhu/Box/projects/ra_code_sample/stata/processed
{txt}
{com}. //_2
. * Import demographic data
. import delimited "$data/demo.csv", clear
{res}{text}(4 vars, 20,436 obs)

{com}. 
. * Make sure person_id is uid
. duplicates drop

{p 0 4}{txt}Duplicates in terms of {txt} all variables{p_end}

(4,721 observations deleted)

{com}. isid person_id
{txt}
{com}. //_3
. tab gender, m

     {txt}gender {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          F {c |}{res}      2,936       18.68       18.68
{txt}          M {c |}{res}     11,707       74.50       93.18
{txt}     female {c |}{res}        179        1.14       94.32
{txt}       male {c |}{res}        893        5.68      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     15,715      100.00
{txt}
{com}. replace gender = "F" if gender == "female"
{txt}(179 real changes made)

{com}. replace gender = "M" if gender == "male"
{txt}(893 real changes made)

{com}. 
. * Check if gender is consistently coded
. assert gender == "M" | gender == "F"
{txt}
{com}. 
. * Save cleaned demographic data
. save "$processed/demo_clean.dta", replace
{txt}file /Users/celiazhu/Box/projects/ra_code_sample/stata/processed/demo_clean.dta saved

{com}. //_4
. * Import arrests data
. import delimited "$data/case.csv", clear
{res}{text}(8 vars, 26,000 obs)

{com}. 
. * Make sure caseid is uid
. isid caseid
{txt}
{com}. 
. merge m:1 person_id using "$processed/demo_clean.dta", nogen keep(3)
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          26,000{txt}  
{col 5}{hline 41}

{com}. //_5
.   replace address = lower(address)
{txt}(26,000 real changes made)

{com}.   keep if strpos(address, ", chicago") > 0
{txt}(1,000 observations deleted)

{com}. //_6
. * Glimpse the `arrest_date` and `bdate` to know their formats.
. codebook arrest_date bdate

{txt}{hline}
{res}arrest_date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  string ({res}str10{txt})

{col 10}unique values:  {res}666{col 51}{txt}missing "":  {res}0{txt}/{res}25,000

{txt}{col 15}examples:  {res}"2012-05-12"
{col 26}"2012-09-25"
{col 26}"2013-02-06"
{col 26}"2013-06-23"

{txt}{hline}
{res}bdate{right:(unlabeled)}
{txt}{hline}

{col 19}type:  string ({res}str10{txt})

{col 10}unique values:  {res}7,603{col 51}{txt}missing "":  {res}0{txt}/{res}25,000

{txt}{col 15}examples:  {res}"1976-05-05"
{col 26}"1981-04-18"
{col 26}"1985-02-25"
{col 26}"1989-04-10"
{txt}
{com}. foreach var of varlist arrest_date bdate{c -(}
{txt}  2{com}. gen `var'_dt = date(`var', "YMD")
{txt}  3{com}.   {c )-}
{txt}
{com}. gen age = round((arrest_date_dt - bdate_dt)/365.25,0.1)
{txt}
{com}. 
. * Save cleaned case and demographic data
. save "$processed/case_demo_clean.dta", replace
{txt}file /Users/celiazhu/Box/projects/ra_code_sample/stata/processed/case_demo_clean.dta saved

{com}. //_7
. * Import grade data
. import delimited "$data/grades.csv", clear
{res}{text}(17 vars, 11,251 obs)

{com}. 
. * Construct 9th and 10th GPA for defendants between the age of 18 and 24
. foreach g of varlist gr* {c -(}
{txt}  2{com}.   gen n_`g' = cond(`g' == "A", 4, ///
>           cond(`g' == "B", 3, ///
>           cond(`g' == "C", 2, ///
>           cond(`g' == "D", 1, ///
>           cond(`g' == "F", 0, .)))))
{txt}  3{com}.   {c )-}
{txt}(2,251 missing values generated)
(2,251 missing values generated)
(2,251 missing values generated)
(2,251 missing values generated)
(2,251 missing values generated)
(2,251 missing values generated)
(2,251 missing values generated)
(2,251 missing values generated)
(2,251 missing values generated)
(2,251 missing values generated)
(2,251 missing values generated)
(2,251 missing values generated)
(2,251 missing values generated)
(2,251 missing values generated)
(2,251 missing values generated)
(2,251 missing values generated)

{com}. 
. forvalues i = 9/10{c -(}
{txt}  2{com}.   local grade`i' n_gr`i'_*
{txt}  3{com}.   egen gpa`i' = rmean(`grade`i'')
{txt}  4{com}. {c )-}
{txt}
{com}. 
. * Sanity check on GPAs
. su gpa*

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}gpa9 {c |}{res}     11,251    2.661426    .6469981          0          4
{txt}{space 7}gpa10 {c |}{res}     11,251    2.661316    .6479062        .25          4
{txt}
{com}. 
. * Keep person id and gpa for grade 9 and 10
. keep person_id gpa*
{txt}
{com}. isid person_id
{txt}
{com}. 
. * Save cleaned grades data
. save "$processed/grades_clean.dta", replace
{txt}file /Users/celiazhu/Box/projects/ra_code_sample/stata/processed/grades_clean.dta saved

{com}. //_8
. use "$processed/case_demo_clean.dta", clear
{txt}
{com}. 
. * The study population should have 25,000 subjects
. assert(_N == 25000)
{txt}
{com}. 
. * Create dummies for gender and race.
. tab gender, m gen(gender_)

     {txt}gender {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          F {c |}{res}      4,936       19.74       19.74
{txt}          M {c |}{res}     20,064       80.26      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     25,000      100.00
{txt}
{com}. rename gender_1 female
{res}{txt}
{com}. label var female "Female"
{txt}
{com}. rename gender_2 male
{res}{txt}
{com}. label var male "Male"
{txt}
{com}. 
. tab race, m gen(race_)

       {txt}race {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      ASIAN {c |}{res}      1,239        4.96        4.96
{txt}      BLACK {c |}{res}     18,249       73.00       77.95
{txt}      WHITE {c |}{res}      5,512       22.05      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     25,000      100.00
{txt}
{com}. rename race_1 asian
{res}{txt}
{com}. rename race_2 black
{res}{txt}
{com}. rename race_3 white
{res}{txt}
{com}. label var asian "Asian"
{txt}
{com}. label var black "Black"
{txt}
{com}. label var white "White"
{txt}
{com}. 
. * Label variables for cleaner output.
. label var age "Age"
{txt}
{com}. label var prior_arrests "Number of prior arrests"
{txt}
{com}. label var re_arrest "Re-arrested"
{txt}
{com}. label var treat "Enrolled into program"
{txt}
{com}. 
. label define treat_lab 0 "Unenrolled" 1 "Enrolled"
{txt}
{com}. label define male_lab 0"Female" 1"Male"
{txt}
{com}. label define black_lab 0"Non-Black" 1"Black"
{txt}
{com}. label define white_lab 0"Non-White" 1"White"
{txt}
{com}. 
. foreach var of varlist treat male black white {c -(}
{txt}  2{com}.   label values `var' `var'_lab
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Save cleaned data with dummies
. save "$processed/analysis_data.dta", replace
{txt}file /Users/celiazhu/Box/projects/ra_code_sample/stata/processed/analysis_data.dta saved

{com}. 
. * Define a local macro for covariates.
. local balancevar "female male asian black white prior_arrests age"
{txt}
{com}. //_9
. eststo clear
{txt}
{com}. qui estpost su `balancevar'
{txt}
{com}. esttab using "$output/summary_statistics.tex", replace ///
> cells("mean(fmt(2)) sd(fmt(0 0 0 0 0 0 1)) min(fmt(0 0 0 0 0 0 1)) max(fmt(0 0 0 0 0 0 1))") ///
> collabel("Mean" "Standard Deviation" "Min" "Max" ) ///
> width(\textwidth) nonumber  label
{res}{txt}(output written to {browse  `"/Users/celiazhu/Box/projects/ra_code_sample/stata/output/summary_statistics.tex"'})

{com}. //_10
. iebaltab `balancevar', grpvar(treat) ///
> vce(robust) savetex("$output/balance_test.tex") replace ///
> rowvarlabels pttest ftest fnoobs pftest
{res}{phang}Balance table saved to: {browse "/Users/celiazhu/Box/projects/ra_code_sample/stata/output/balance_test.tex":/Users/celiazhu/Box/projects/ra_code_sample/stata/output/balance_test.tex} 
{txt}
{smcl}
{com}. //_11
. preserve
{txt}
{com}. encode race, gen(n_race)
{txt}
{com}. qui: codebook n_race
{txt}
{com}. 
. gen avg = .
{txt}(25,000 missing values generated)

{com}. gen ci_low = .
{txt}(25,000 missing values generated)

{com}. gen ci_high = .
{txt}(25,000 missing values generated)

{com}. 
. * Calculate means and confidence intervals
. qui: mean prior_arrests, over(treat n_race)
{txt}
{com}. matrix M = r(table)
{txt}
{com}. matrix list M
{res}
{txt}M[9,6]
         prior_arr~s:  prior_arr~s:  prior_arr~s:  prior_arr~s:  prior_arr~s:  prior_arr~s:
           _subpop_1     _subpop_2     _subpop_3     _subpop_4     _subpop_5     _subpop_6
     b {res}    3.1284722     3.1516698      3.158808     4.2880845     4.3943896     4.3575673
{txt}    se {res}    .07721162     .01987445     .03608994     .07927011      .0227264     .04104244
{txt}     t {res}    40.518155     158.57896     87.526007     54.094593     193.36061     106.17222
{txt}pvalue {res}            0             0             0             0             0             0
{txt}    ll {res}    2.9771329     3.1127147     3.0880696     4.1327104     4.3498445     4.2771217
{txt}    ul {res}    3.2798115     3.1906249     3.2295464     4.4434586     4.4389347     4.4380129
{txt}    df {res}        24999         24999         24999         24999         24999         24999
{txt}  crit {res}    1.9600589     1.9600589     1.9600589     1.9600589     1.9600589     1.9600589
{txt} eform {res}            0             0             0             0             0             0
{reset}
{com}. 
. forvalues i = 1/6 {c -(}
{txt}  2{com}.   if inrange(`i', 1, 3) == 1{c -(}
{txt}  3{com}. replace avg = M[1, `i'] if treat == 0 & n_race == `i'
{txt}  4{com}. replace ci_low = M[5, `i'] if treat == 0 & n_race == `i'
{txt}  5{com}. replace ci_high = M[6, `i'] if treat == 0 & n_race == `i'
{txt}  6{com}.   {c )-}
{txt}  7{com}. 
.   if inrange(`i', 4, 6) == 1 {c -(}
{txt}  8{com}.   replace avg = M[1, `i'] if treat == 1 & n_race == `i'-3
{txt}  9{com}. replace ci_low = M[5, `i'] if treat == 1 & n_race == `i'-3
{txt} 10{com}. replace ci_high = M[6, `i'] if treat == 1 & n_race == `i'-3
{txt} 11{com}.   {c )-}
{txt} 12{com}. {c )-}
{txt}(576 real changes made)
(576 real changes made)
(576 real changes made)
(8,624 real changes made)
(8,624 real changes made)
(8,624 real changes made)
(2,651 real changes made)
(2,651 real changes made)
(2,651 real changes made)
(663 real changes made)
(663 real changes made)
(663 real changes made)
(9,625 real changes made)
(9,625 real changes made)
(9,625 real changes made)
(2,861 real changes made)
(2,861 real changes made)
(2,861 real changes made)

{com}. 
. * Count observations
. forvalues i = 1/6 {c -(}
{txt}  2{com}.   if inrange(`i', 1, 3) == 1 {c -(}
{txt}  3{com}. count if treat == 0 & n_race == `i' & !missing(prior_arrests)
{txt}  4{com}.   {c )-}
{txt}  5{com}. 
.   if inrange(`i', 4, 6) == 1 {c -(}
{txt}  6{com}.   count if treat == 1 & n_race == `i'-3 & !missing(prior_arrests)
{txt}  7{com}.    {c )-}
{txt}  8{com}. 
.    local `i'N = r(N)
{txt}  9{com}.  {c )-}
  {res}576
  8,624
  2,651
  663
  9,625
  2,861
{txt}
{com}. 
. * Plot the bar chart
. gen treat_race = n_race if treat == 0
{txt}(13,149 missing values generated)

{com}. replace treat_race = n_race + 4 if treat == 1
{txt}(13,149 real changes made)

{com}. twoway (bar avg treat_race if n_race == 1, fcolor(maroon) ///
>       fintensity(inten70) lcolor(white) barw(0.7)) ///
>     (bar avg treat_race if n_race == 2, fcolor(maroon) ///
>       fintensity(inten50) lcolor(white) barw(0.7)) ///
>     (bar avg treat_race if n_race == 3, fcolor(maroon) ///
>       fintensity(inten30) lcolor(white) barw(0.7)) ///
>       (rcap ci_low ci_high treat_race, lcolor(gs5)), ///
>     legend(row(1) order(1 "Asian" 2 "Black" 3 "White" 4 "95% C.I.")) ///
>     xlabel(2"Unenrolled" 6"Enrolled", noticks) xtitle("Enrollment status") ///
>     ylabel(0(1)4) ytitle("Average number of prior arrests", ///
>     margin(medium) size(medium)) ///
>     title("Number of prior arrests imbalanced" ///
>     "between enrolled and unenrolled groups", size(medium)) ///
>     note("Number of defendants:" ///
>     "Asian unenrolled `1N', Black unenrolled `2N', White unenrolled `3N'" ///
>       "Asian enrolled `4N', Black enrolled `5N', White enrolled `6N'") ///
>     caption("Source: Cook County State's Attorney's Office", ///
>     justification(left) size(vsmall) linegap(0.8) position(5) span) ///
>     graphregion( color(white) ) plotregion(fcolor(white))
{res}{txt}
{com}. 
. graph export "$output/prior_arrests.png", replace
{txt}(file /Users/celiazhu/Box/projects/ra_code_sample/stata/output/prior_arrests.png written in PNG format)

{com}. restore
{txt}
{com}. //_12
. // Get propensity score
. * Let female and asian be base groups
. local covlist "male black white prior_arrests age"
{txt}
{com}. qui logit treat `covlist'
{txt}
{com}. predict pscore, pr
{txt}
{com}. 
. // Inverse probability weighting (IPW)
. * Weight for average treatment effect (ATE)
. gen double ate_weight = 1.treat/pscore + 0.treat/(1-pscore)
{txt}
{com}. * Weight for average treatment effect on the treated (ATET)
. gen double atet_weight = 1.treat/1 + 0.treat * pscore/(1-pscore)
{txt}
{com}. 
. // Common support
. gen support = 1
{txt}
{com}. forvalues i = 1/2 {c -(}
{txt}  2{com}.     su pscore if treat == `i' -1
{txt}  3{com}.     replace support = 0 if inrange(pscore, r(min), r(max)) == 0
{txt}  4{com}.   {c )-}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}pscore {c |}{res}     11,851    .4821746    .1287615   .2568446   .9319222
{txt}(16 real changes made)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}pscore {c |}{res}     13,149    .5654231    .1457166   .2577653   .9778187
{txt}(4 real changes made)

{com}. //_13
. su pscore if support == 1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}pscore {c |}{res}     24,980    .5257297     .143676   .2577653   .9319222
{txt}
{com}. local lhs = r(min)
{txt}
{com}. local rhs = r(max)
{txt}
{com}. di `lhs'
{res}.25776526
{txt}
{com}. di `rhs'
{res}.9319222
{txt}
{com}. histogram pscore, xline(`lhs', lcolor(black) lwidth(thin) lpattern(dash)) ///
> xline(`rhs', lcolor(black) lwidth(thin) lpattern(dash)) ///
> freq width(0.05) ///
> by(treat, row(2) graphregion(color(white)) note("Source: Cook County State's Attorney's Office" ///
> "(Observations bounded by vertical lines within common support)", size(small))) ///
> fcolor(maroon%70) lcolor(white%0) ///
> xtitle("Propensity score", size(medsmall)) ///
> ytitle("Frequency", size(medsmall))
{res}{txt}
{com}. 
. graph export "$output/ps_hist.png", replace
{txt}(file /Users/celiazhu/Box/projects/ra_code_sample/stata/output/ps_hist.png written in PNG format)

{com}. //_14
. eststo clear
{txt}
{com}. qui estpost su `balancevar' if support == 1 [aw = ate_weight]
{txt}
{com}. esttab using "$output/summary_statistics_cs.tex", replace ///
> cells("count(fmt(0)) mean(fmt(2)) sd(fmt(2)) min(fmt(0 0 0 0 0 0 1)) max(fmt(0 0 0 0 0 0 1))") ///
> collabel("N" "Mean" "Standard Deviation" "Min" "Max" ) ///
> width(\textwidth) nonumber  label
{res}{txt}(output written to {browse  `"/Users/celiazhu/Box/projects/ra_code_sample/stata/output/summary_statistics_cs.tex"'})

{com}. //_15
. iebaltab `balancevar'  if support == 1 [pw = ate_weight], grpvar(treat)  ///
> vce(robust) savetex("$output/balance_test_ipw.tex") replace ///
> rowvarlabels pttest ftest fnoobs pftest
{res}{phang}Balance table saved to: {browse "/Users/celiazhu/Box/projects/ra_code_sample/stata/output/balance_test_ipw.tex":/Users/celiazhu/Box/projects/ra_code_sample/stata/output/balance_test_ipw.tex} 
{txt}
{smcl}
{com}. //_16
. unique person_id
{txt}Number of unique values of person_id is  {res}14353
{txt}Number of records is  {res}25000
{txt}
{com}. eststo clear
{txt}
{com}. eststo: qui reg re_arrest treat `covlist', rob
{txt}({res}est1{txt} stored)

{com}. //_17
. eststo: logit re_arrest treat `covlist', rob cluster(person_id)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res: -12852.89}  
Iteration 1:{space 3}log pseudolikelihood = {res:-12621.071}  
Iteration 2:{space 3}log pseudolikelihood = {res:-12618.548}  
Iteration 3:{space 3}log pseudolikelihood = {res:-12618.548}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}    25,000
{txt}{col 49}Wald chi2({res}6{txt}){col 67}= {res}    680.50
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log pseudolikelihood = {res}-12618.548{txt}{col 49}Pseudo R2{col 67}= {res}    0.0182

{txt}{ralign 79:(Std. Err. adjusted for {res:14,353} clusters in person_id)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}    re_arrest{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}treat {c |}{col 15}{res}{space 2}-.0935816{col 27}{space 2} .0328717{col 38}{space 1}   -2.85{col 47}{space 3}0.004{col 55}{space 4}-.1580089{col 68}{space 3}-.0291543
{txt}{space 9}male {c |}{col 15}{res}{space 2} .0318649{col 27}{space 2} .0379127{col 38}{space 1}    0.84{col 47}{space 3}0.401{col 55}{space 4}-.0424426{col 68}{space 3} .1061724
{txt}{space 8}black {c |}{col 15}{res}{space 2} .0321375{col 27}{space 2} .0730498{col 38}{space 1}    0.44{col 47}{space 3}0.660{col 55}{space 4}-.1110376{col 68}{space 3} .1753125
{txt}{space 8}white {c |}{col 15}{res}{space 2} .0178003{col 27}{space 2} .0772279{col 38}{space 1}    0.23{col 47}{space 3}0.818{col 55}{space 4}-.1335637{col 68}{space 3} .1691642
{txt}prior_arrests {c |}{col 15}{res}{space 2} .0922383{col 27}{space 2}  .008603{col 38}{space 1}   10.72{col 47}{space 3}0.000{col 55}{space 4} .0753768{col 68}{space 3} .1090999
{txt}{space 10}age {c |}{col 15}{res}{space 2} .0220245{col 27}{space 2} .0025201{col 38}{space 1}    8.74{col 47}{space 3}0.000{col 55}{space 4} .0170852{col 68}{space 3} .0269637
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}-2.377173{col 27}{space 2} .0996872{col 38}{space 1}  -23.85{col 47}{space 3}0.000{col 55}{space 4}-2.572556{col 68}{space 3}-2.181789
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
({res}est2{txt} stored)

{com}. //_18
. eststo: qui reg re_arrest treat [pw = ate_weight] if support == 1
{txt}({res}est3{txt} stored)

{com}. eststo: qui reg re_arrest treat [pw = atet_weight] if support == 1
{txt}({res}est4{txt} stored)

{com}. //_19
. esttab using "$output/estimation.tex", se  label nobaselevels noomitted ///
> addnotes("Model 1: OLS; Model 2: Logit; Model 3: IPW (ATE); Model 4: IPW (ATET)" ///
> "Odds ratio reported in logit model" ///
> "Robust s.e. reported in OLS model; clustered robust s.e. reported in logit model") ///
> eform(0 1 0 0 ) replace eqlabels(none)
{res}{txt}(output written to {browse  `"/Users/celiazhu/Box/projects/ra_code_sample/stata/output/estimation.tex"'})

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/celiazhu/Box/projects/ra_code_sample/stata/ra_stata_sample.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 9 Sep 2020, 12:46:17
{txt}{.-}
{smcl}
{txt}{sf}{ul off}