{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/celiazhu/Box/projects/ra_code_sample/io_code_sample/code_sample.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}14 Feb 2021, 17:55:06
{txt}
{com}. //_1
. clear all
{res}{txt}
{com}. set more off
{txt}
{com}. set varabbrev off
{txt}
{com}. 
. // project directory
. global path "/Users/celiazhu/Box/projects/ra_code_sample/io_code_sample"
{txt}
{com}. * Data directory
. global data "$path/data"
{txt}
{com}. * Figure directory
. global figure "$path/output/figure"
{txt}
{com}. * Table directory
. global table "$path/output/table"
{txt}
{com}. //_2
. local carcsv: dir "$data/car_data" files "*.csv"
{txt}
{com}. foreach file of local carcsv {c -(}
{txt}  2{com}.   preserve
{txt}  3{com}.   qui insheet using "$data/car_data/`file'", clear
{txt}  4{com}.   qui cap destring sp, force replace // change sp (maximum speed) from string to numeric
{txt}  5{com}.   qui replace ye = 1900 + ye // use full year
{txt}  6{com}.   foreach var of varlist ma loc {c -(}
{txt}  7{com}. qui replace `var' = "United Kingdom" if `var' == "UK" // use full country name
{txt}  8{com}.   {c )-}
{txt}  9{com}.   qui save temp, replace
{txt} 10{com}.   restore
{txt} 11{com}.   qui append using temp
{txt} 12{com}. {c )-}
{txt}
{com}. save "$data/clean_data/car_data_all.dta", replace
{txt}file /Users/celiazhu/Box/projects/ra_code_sample/io_code_sample/data/clean_data/car_data_all.dta saved

{com}. rm temp.dta
{txt}
{com}. //_3
. clear
{txt}
{com}. local mktcsv: dir "$data/market_data" files "*.csv"
{txt}
{com}. foreach file of local mktcsv {c -(}
{txt}  2{com}.   preserve
{txt}  3{com}.   qui insheet using "$data/market_data/`file'", clear
{txt}  4{com}.   qui save temp, replace
{txt}  5{com}.   restore
{txt}  6{com}.   qui append using temp
{txt}  7{com}. {c )-}
{txt}
{com}. //_4
. local country_list `" "Belgium" "France" "Germany" "Italy" "United Kingdom" "'
{txt}
{com}. /* Abbreviated market name corresponds to the first letter of the full country
> name, and the correspondence is unique in this dataset. */
. foreach country in `country_list' {c -(}
{txt}  2{com}. qui replace ma = "`country'" if ma == substr("`country'", 1, 1)
{txt}  3{com}. {c )-}
{txt}
{com}. save "$data/clean_data/market_data_all.dta", replace
{txt}file /Users/celiazhu/Box/projects/ra_code_sample/io_code_sample/data/clean_data/market_data_all.dta saved

{com}. rm temp.dta
{txt}
{com}. //_5
. merge 1:m ye ma using "$data/clean_data/car_data_all.dta", nogen
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}           7,679{txt}  
{col 5}{hline 41}

{com}. //_6
. qui destring li*, force replace
{txt}
{com}. replace li = (li1 + li2 + li3)/3 if li == .
{txt}(1,919 real changes made)

{com}. foreach var of varlist li1 li2 li3 {c -(}
{txt}  2{com}.   qui replace `var' = 0 if `var' == .
{txt}  3{com}.   qui replace `var' = li*3 - (li1 + li2 + li3) if `var' == 0
{txt}  4{com}. {c )-}
{txt}
{com}. //_7
. qui destring ac, force replace // ac (time to acceleration) is float
{txt}
{com}. foreach var of varlist ma loc brand model cla frm {c -(}
{txt}  2{com}.   qui encode `var', gen(`var'_code) // transform string to categorical variables
{txt}  3{com}. {c )-}
{txt}
{com}. //_8
. label var hp "Horsepower (kW)"
{txt}
{com}. label var li "Fuel consumption (liter per km)"
{txt}
{com}. label var eurpr "Price in common currency"
{txt}
{com}. //_9
. qui save "$data/clean_data/all_data.dta", replace
{txt}
{com}. //_10
. preserve
{txt}
{com}. // a temporary dataset for 1970 data
. tempfile data_70
{txt}
{com}. * keep 1970 data
. keep if ye == 1970
{txt}(7,407 observations deleted)

{com}. * keep neede variables
. keep ye qu hp li ma_code model_code
{txt}
{com}. qui save `data_70', replace
{txt}
{com}. restore
{txt}
{com}. 
. preserve
{txt}
{com}. // a temporary dataset for 1970 data
. tempfile data_90
{txt}
{com}. * keep 1990 data
. keep if ye == 1990
{txt}(7,281 observations deleted)

{com}. * keep needeed variables
. keep ye qu hp li ma_code model_code
{txt}
{com}. qui save `data_90', replace
{txt}
{com}. restore
{txt}
{com}. //_11
. /* 1) group cars by decile of horsepower; 2) fit curves; 3) summary statistics
> of horsepower and sales in each decile group;
> 
> compute midpoint of each decile group;
>  compute sales-weighted average of fuel consumption; 4) fit curves*/
. foreach year of numlist 70 90 {c -(}
{txt}  2{com}.   use `data_`year'', clear
{txt}  3{com}.   // 1) group cars by decile of horsepower
.   xtile hp_decile = hp, nq(10)
{txt}  4{com}.   bysort hp_decile: asgen wtd_avg_li = li, weight(qu)
{txt}  5{com}.   // 2) fit curves; use sales as sample weights
.   qui gen loghp = ln(hp)
{txt}  6{com}.   sort ye ma_code model_code
{txt}  7{com}.   qui reg li hp loghp [pw = qu]
{txt}  8{com}.   qui predict li_hat
{txt}  9{com}.   // 3) summary statistics of horsepower and sales in each decile group
.   qui gen hp_mid = .
{txt} 10{com}.   qui gen hp_min = .
{txt} 11{com}.   qui gen hp_max = .
{txt} 12{com}.   qui gen qu_total = .
{txt} 13{com}.   * loop over each horsepower decile group
.   forvalues  i = 1/10 {c -(}
{txt} 14{com}. * horsepower summary statistics
. qui su hp if hp_decile == `i'
{txt} 15{com}. local hp_min r(min)
{txt} 16{com}. local hp_max r(max)
{txt} 17{com}. qui replace hp_min = `hp_min' if hp_decile == `i'
{txt} 18{com}. qui replace hp_max = `hp_max' if hp_decile == `i'
{txt} 19{com}. * midpoint of each decile group for x-axis of scatterplot
. qui replace hp_mid = (hp_min + hp_max)/2 if hp_decile == `i'
{txt} 20{com}. * sales summary statistics
. qui su qu if hp_decile == `i'
{txt} 21{com}. local qu_total r(sum)
{txt} 22{com}. qui replace qu_total = `qu_total' if hp_decile == `i'
{txt} 23{com}.   {c )-}
{txt} 24{com}.   qui save `data_`year'', replace
{txt} 25{com}. {c )-}
{txt}
{com}. 
. * Aggregated data of fuel consumption and horsepower in 1970 and 1990
. use `data_70', clear
{txt}
{com}. append using `data_90'
{txt}(label model_code already defined)
(label ma_code already defined)

{com}. collapse (first) wtd_avg_li hp_min hp_max hp_mid li_hat qu_total, by(ye hp_decile)
{txt}
{com}. label var wtd_avg_li "Sales-weighted average of fuel consumption"
{txt}
{com}. label var hp_mid "Midpoint of horsepower decile"
{txt}
{com}. //_12
. local file_name relation_li_hp
{txt}
{com}. twoway (scatter wtd_avg_li hp_mid if ye == 1970, mcolor(navy%70)) ///
> (scatter wtd_avg_li hp_mid if ye == 1990, mcolor(orange%70)) ///
> (line li_hat hp_mid if ye == 1970, sort lcolor(navy%70) lpattern(shortdash)) ///
> (line li_hat hp_mid if ye == 1990, sort lcolor(orange%70) lpattern(longdash)), ///
> xlabel(15(15)150) ylabel(5(2)15) ///
> xtitle("Midpoint of each horsepower decile (kW)", size(medsmall)) ///
> ytitle("Sales-weighted average of fuel consumption (liter per km)", size(medsmall) margin(top)) ///
> title("Relationship between Fuel Consumption and Horsepower in 1970 and 1990", ///
> size(medsmall) color(black)) ///
> legend(label(1 "1970") label(2 "1990") ///
> label(3 "1970 fitted curve") label(4 "1990 fitted curve") ///
> nobox region(lcolor(white)) size(small) rows(1)) ///
> graphregion(color(white))
{res}{txt}
{com}. qui graph export "$figure/`file_name'.png", replace
{txt}
{com}. //_13
. * prepare data to generate texsave table
. qui gen wtd_avg_li_3 = string(wtd_avg_li,"%4.3f") // round up to 3 decimal places
{txt}
{com}. qui drop wtd_avg_li
{txt}
{com}. rename wtd_avg_li_3 wtd_avg_li
{res}{txt}
{com}. qui reshape wide wtd_avg_li hp_min hp_max hp_mid li_hat qu_total, i(hp_decile) j(ye)
{txt}
{com}. foreach year of numlist 1970 1990 {c -(}
{txt}  2{com}.   * horsepower range of each decile group
.   egen hp_range`year' = concat(hp_min`year' hp_max`year'), punct("--")
{txt}  3{com}.   * insert comma in total sales quantity
.   gen qu_total`year'_comma = string(qu_total`year', "%15.0fc")
{txt}  4{com}.   drop qu_total`year'
{txt}  5{com}.   rename qu_total`year'_comma qu_total`year'
{txt}  6{com}. {c )-}
{res}{txt}
{com}. 
. * reorder variables
. order hp_decile wtd_avg_li1970 hp_range1970 qu_total1970 ///
> wtd_avg_li1990 hp_range1990 qu_total1990
{txt}
{com}. 
. * drop un-needed variables
. drop hp_min* hp_max* hp_mid* li_hat*
{txt}
{com}. 
. * generate summary statistics table
. local file_name hp_sum_table
{txt}
{com}. local title title("Sales-weighted average of fuel consumption by decile of horsepower")
{txt}
{com}. local midliners "\cmidrule(lr){c -(}2-4{c )-} \cmidrule(lr){c -(}5-7{c )-} \addlinespace[-2.5ex]"
{txt}
{com}. local colnames "{c -(}Decile{c )-} &{c -(}Fuel consumption{c )-} &{c -(}Horsepower range{c )-} &{c -(}Sales{c )-} &{c -(}Fuel consumption{c )-} &{c -(}Horsepower range{c )-} &{c -(}Sales{c )-} "
{txt}
{com}. local headerlines headerlines("& \multicolumn{c -(}3{c )-}{c -(}c{c )-}{c -(}1970{c )-} & \multicolumn{c -(}3{c )-}{c -(}c{c )-}{c -(}1990{c )-}" "`midliners'" "`colnames'")
{txt}
{com}. local fn footnote("Fuel consumption represents the sales-weighted average of fuel consumption.")
{txt}
{com}. local marker marker("tab:1")
{txt}
{com}. local size size("small")
{txt}
{com}. texsave using "$table/`file_name'.tex", replace ///
> loc(H) frag nonames `headerlines' `marker' `fn' `size' `title'
{txt}
{com}. //_14
. use "$data/clean_data/all_data.dta", clear
{txt}
{com}. 
. * sort observations to better repliacte results
. sort ye ma_code model_code
{txt}
{com}. 
. * Generate the number of consumers in market j in year t
. gen n_consumers = pop/4 // 4 is average family size; assume each family potentially buys one car
{txt}
{com}. label var n_consumers "Number of consumers"
{txt}
{com}. 
. * Generate market share of car model i in market j in year t
. gen share = qu/n_consumers
{txt}
{com}. label var share "Market share"
{txt}
{com}. 
. * Generate share of consumers who by no cars in market j in year t
. bysort ma_code ye: egen qu_total = total(qu)
{txt}
{com}. gen share_no_cars = 1 - qu_total/n_consumers
{txt}
{com}. label var share_no_cars "Share of consumers who buy no cars"
{txt}
{com}. 
. * Generate outcome variable
. gen outcome = ln(share) - ln(share_no_cars)
{txt}
{com}. label var outcome "Outcome"
{txt}
{com}. 
. // Regress outcome variable on a constant, fuel consumption, and price; no fixed effects
. eststo clear
{txt}
{com}. * Heteroskedastic robust standard error with no cluster
. eststo: qui reg outcome li eurpr, r
{txt}({res}est1{txt} stored)

{com}. qui estadd local se "Non-clustered robust"
{txt}
{com}. qui estadd local fe "None"
{txt}
{com}. 
. * cluster on car model
. eststo: qui reg outcome li eurpr, vce(cluster model_code)
{txt}({res}est2{txt} stored)

{com}. qui estadd local se "Clustered on model"
{txt}
{com}. qui estadd local fe "None"
{txt}
{com}. 
. * cluster on market
. eststo: qui reg outcome li eurpr, vce(cluster ma_code)
{txt}({res}est3{txt} stored)

{com}. qui estadd local se "Clustered on market"
{txt}
{com}. qui estadd local fe "None"
{txt}
{com}. 
. * cluster on year
. eststo: qui reg outcome li eurpr, vce(cluster ye)
{txt}({res}est4{txt} stored)

{com}. qui estadd local se "Clustered on year"
{txt}
{com}. qui estadd local fe "None"
{txt}
{com}. 
. // Output regression tables
. local file_name reg
{txt}
{com}. local title "Structural parameters for fuel consumption and price"
{txt}
{com}. local label \label{c -(}tab:1{c )-}
{txt}
{com}. local reg_tbl_setting "se booktabs width(\textwidth) label nofloat scalars("fe Fixed effects" "se Standard errors")"
{txt}
{com}. qui esttab using "$table/`file_name'.tex", replace title("`title' `label'") ///
> `reg_tbl_setting'
{txt}
{com}. //_15
. // Including car model, market, and year fixed effects;
. * no cluster
. eststo clear
{txt}
{com}. eststo: qui reg outcome li eurpr i.ma_code i.model_code i.ye, r
{txt}({res}est1{txt} stored)

{com}. qui estadd local fe "car model, market, and year"
{txt}
{com}. 
. * cluster on model
. eststo: qui reg outcome li eurpr i.ma_code i.model_code i.ye, vce(cluster model_code)
{txt}({res}est2{txt} stored)

{com}. qui estadd local se "Clustered on model"
{txt}
{com}. qui estadd local fe "car model, market, and year"
{txt}
{com}. 
. * cluster on market
. eststo: qui reg outcome li eurpr i.ma_code i.model_code i.ye, vce(cluster ma_code)
{txt}({res}est3{txt} stored)

{com}. qui estadd local se "Clustered on market"
{txt}
{com}. qui estadd local fe "car model, market, and year"
{txt}
{com}. 
. * cluster on year
. eststo: qui reg outcome li eurpr i.ma_code i.model_code i.ye, vce(cluster ye)
{txt}({res}est4{txt} stored)

{com}. qui estadd local se "Clustered on year"
{txt}
{com}. qui estadd local fe "car model, market, and year"
{txt}
{com}. 
. // Output regression tables
. local file_name reg_fe
{txt}
{com}. local title "Structural parameters for fuel consumption and price (added fixed effects)"
{txt}
{com}. local label \label{c -(}tab:2{c )-}
{txt}
{com}. qui esttab using "$table/`file_name'.tex", replace ///
> drop(*.ma_code *.model_code *.ye) title("`title' `label'") ///
> `reg_tbl_setting'
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/celiazhu/Box/projects/ra_code_sample/io_code_sample/code_sample.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}14 Feb 2021, 17:55:15
{txt}{.-}
{smcl}
{txt}{sf}{ul off}